%%%-------------------------------------------------------------------
%%% @author lizhipeng
%%% @copyright (C) 2018, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 04. 七月 2018 15:27
%%%-------------------------------------------------------------------

%%------------------------------练功房总览信息请求--------------------------------
-define(PT_TRAIN_INVENTORY,  39000).

% 协议号：39000
% C >> S:
%%      仅发协议号
% S >> C:
%       array{
%           lv_train		  		u8		练功房等级(1:简陋；2:普通，3:高级，4:大师，5:宗师)
%       }
%       arts_num                u16     玩家目前内功的数量
%       array{
%           art_id		  		    u64		练功房临时背包
%           art_no		  		    u32		功法编号
%       }


%%------------------------------------- 练功请求 -----------------------------
-define(PT_START_TRAIN,  39001).

% 协议号：39001
% C >> S:
%       cost                   u8      1为默认消耗，2为勾选后的付费消耗
%       no                     u8      练功房等级，对应练功房基础表的no
% S >> C:
%       art_id                 u64      内功唯一id
%       art_no                 u32      内功的编号
%       array{                          已激活的练功房等级
%           lv_train		   u8		练功房等级(1:简陋；2:普通，3:高级，4:大师，5:宗师)
%       }
%

%%-----------------------------获取内功详细信息-------------------------------------
-define(PT_ARTS_INVENTORY,  39002).

% 协议号：39002
% C >> S:
%       仅发协议号
% S >> C:
%       array(
%           art_id              u64         内功唯一id
%           art_no              u32         内功的编号
%           partner_id          u64         门客唯一id，如果是获取玩家的，则此字段是0
%           bind_state          u8          是否佩戴，0否，1是
%           star                u8          内功品质(1~5星)
%           lv                  u16          内功等级
%           exp                 u16         内功经验
%%          index               u8         槽位
%       )
%

%%-----------------------------获取玩家自己的单个内功属性信息-------------------------------------
%% 协议号：39002
%% C >> S:
%%      art_id          u64         内功唯一id
%%
%% S >> C:

%%-------------------------------佩戴内功-------------------------------
-define(PT_PUTON_ARTS,  39003).

%% 协议号：39003
%% C >> S:
%%      PartnerId       u64        门客唯一id，如果是获取玩家的，则此字段是0
%%      art_id          u64        内功唯一id（指明佩戴的是哪一个内功）
%%      index           u8         槽位

%% S >> C:
%%      ResCode      u8         若成功则返回0，否则不返回，而是直接发送失败提示消息协议（涉及的失败原因见如下说明）
%%      PartnerId    u64        门客唯一id，如果是获取玩家的，则此字段是0
%%      art_id       u64        内功唯一id（指明佩戴的是哪一个内功）
%%      index           u8         槽位


%%----------------------------脱内功-------------------------------
-define(PT_TAKEOFF_ARTS,  39004).

%% 协议号：39004
%% C >> S:
%%      PartnerId       u64        门客唯一id，如果是获取玩家的，则此字段是0
%%      art_id          u64        内功唯一id（指明佩戴的是哪一个内功）
%%      index           u8         槽位

%% S >> C:
%%      ResCode         u8         若成功则返回0，否则不返回，而是直接发送提示消息的协议（涉及的失败原因见如下说明）
%%      PartnerId       u64        门客唯一id，如果是获取玩家的，则此字段是0
%%      art_id          u64        内功唯一id
%%      index           u8         槽位


%% 失败原因：（宏定义在prompt_msg_code.hrl）
%% PM_UNKNOWN_ERR -- 未知错误
%% PM_BAG_FULL -- 背包满了

%%----------------------------丢弃内功------------------------------------
%% 已废弃
-define(PT_DISCARD_ARTS,  39005).

%% 协议号：39005
%% C >> S:
%%     	art_id      u64         内功唯一id

%% S >> C:
%%     	ResCode     u8          若成功则返回0，若失败则不返回， 而是直接发送失败提示消息协议（涉及的失败原因见如下说明）
%%     	art_id      u64         内功唯一id


%% 失败原因：
%% PM_CAN_NOT_DISCARD_GOODS -- 该物品不能丢弃

%%----------------------------内功强化------------------------------------
-define(PT_ARTS_TRANSMIT,   39006).

%% 协议号:39006
%% c >> s:
%%		TargetArtId			        u64 		传递目标内功id
%%      array( 					    u64		    被传递的内功列表
%%            art_id
%%           )

%% s >> c:
%%		TargetArtId			        u64 		传递目标内功id
%%      array( 						u64	        被传递的内功列表
%%            art_id
%%           )

%%----------- 通知客户端：更新内功的信息 ------------------------
-define(PT_NOTIFY_ARTS_INFO_CHANGE,     39007).

%% 协议号：39007
%% s >> c:
%%     art_id                   u64  内功唯一id
%%     array(
%%          Key                 u8   信息代号（详见obj_info_code.hrl的宏OI_CODE_XXXX）
%%          NewValue            u32  当前的新值
%%          )


-define(PT_UNLOCK_ART_SLOT, 39010).
%% 协议号：39010
%% c >> s:
%%     partenr_id                   u64  门客id
%%     Lv                           u16  要解锁的格子等级

%% S >> c:
%%     partenr_id                   u64  门客id
%      lv                            u16  成功返回lv的值，失败发送998

-define(PT_GET_ART_SLOT, 39011).
%% 协议号：39011    拾取功法
%% c >> s:
%%      array{
%           art_id		  		    u64		功法唯一ID
%       }

%% S >> c:
%%      array{
%           art_id		  		    u64		成功拾取的功法唯一ID，不成功返回提示
%           art_no		  		    u32		功法编号
%       }