
%%---------打卡翅膀界面的时候推送----------------------
-define(PT_GET_WING, 44001).
%% 协议号：44001
%% c >> s:
%%
%% s >> c:
%%      NowId             u64 正在穿戴的id号
%%      NowNo             u32 正在穿戴的翅膀
%%		array(
%%			WingId        u64  翅膀的id号
%%      	WingNo        u32  翅膀的编号
%%      	Lv            u16  翅膀等级
%%      	Exp           u32  成长值
%%			type 		  u8   非定制类型1
%%		)
%%		array(
%%			WingId		  u64  翅膀的id号
%%      	WingNo        u32  翅膀的编号
%%      	Lv            u16  翅膀等级
%%      	Exp           u32  成长值
%%			type 		  u8   定制类型为0
%%			array(
%%					u8
%%				)
%%		)
%%-------------------------------------


%% ---------------------- 使用和不使用翅膀 -----------------------
-define(PT_USE_OR_UNUSE_WING, 44002).
%% 协议号：13031
%% C >> S:
%%		WingId		  u64   翅膀的id号
%%      WingNo        u32	翅膀的编号
%%		Num			  u8	0表示使用, 1表示不使用
%%---------------------------------------------------------------

%%---------翅膀培养----------------------
-define(PT_TRAIN_WING, 44003).
%% 协议号：44001
%%  c >> s:
%%		WingId		  u64   翅膀的id号
%%      WingNo        u32	翅膀的编号
%%      Feed          u8   	培养类型（0表示道具1， 1表示道具2）
%%		Count         u32	道具数量(培养时Count = 1,一键培养时count = 该道具的全部数量)
%%							1>当道具不足时,后端发998协议(4017) , 提示: 道具数量不足

%%  S >> C:
%%		WingId		  u64   翅膀的id号
%%      WingNo        u32 	翅膀的编号
%%      Lv            u16   翅膀等级
%%      Exp           u32   成长值
%%-------------------------------------

%%---------玩家上线通知前端，玩家正在穿戴的翅膀----------------
-define(PT_NOW_USE_WING, 44004).
%%	c >> s:
%%
%%  S >> C:
%%      Type      u8    类型，目前 1代表翅膀
%%      No        u32 	编号



