%% =========================================================
%% 49   爬塔
%% =========================================================

% =========================
% 爬塔信息
% 协议号：49001
% C >> S:

% S >> C: 
%     cur_floor     u16     当前层数
%     max_floor     u16     总层数
%     chal_times    u8      爬塔剩余挑战次数
%     best_floor    u16     最好进度层数
%     today_has_jump    u8  今日有没有跳过层（0：没跳过  1：跳过）
    

% % =========================
% % 爬塔副本内界面信息
% % 协议号：49002
% S >> C:
%     cur_floor       u16     当前层数
%     chal_times      u8      当前BOSS挑战次数
%     max_chal_times  u8      最大BOSS挑战次数
%     buy_times       u8      当前购买次数
%     max_buy_times   u8      最大购买次数
    
% % =========================
% % 进入爬塔副本
% % 协议号：49003
% C >> S:
%     type            u8      0代表普通进入，1代表普通跳层，2代表完美跳层
%     cur_floor       u16     进入的层数
% S >> C:
% 这里是跳层所获得的奖励
% array(
%     GoodsId     u64
%     GoodsNo     u32
%     GoodsNum    u32
%     GoodsQua    u8
%     bind        u8          绑定状态
%     )
% -define(ERROR, 0).
% -define(SUCCESS, 1).
% -define(LV_NOT_ENGOUTH, 2).
% -define(TEAM_LIMIT, 3).
% -define(DUN_LIMIT, 4).
% -define(CD_LIMIT, 5).
% -define(VIP_LIMIT, 6).   
% -define(FLOOR_NOT_REACH, 7). 未通关此层        

% % =========================
% % 清除进度
% % 协议号：49004 
% C >> S: 

% S >> C:
%     flag    u8      状态
%     chal_times    u8      爬塔剩余挑战次数
    
    
% % =========================
% % 添加挑战次数
% % 协议号：49005
% C >> S:
%     flag    u8      1->是；0->否


% % =========================
% % 爬塔战斗失败
% % 协议号：49006
% S >> C:
% 

% % =========================
% % 爬塔奖励反馈
% % 协议号：49007
% S >> C:
% array(
%     GoodsId     u64
%     GoodsNo     u32
%     GoodsNum    u32
%     GoodsQua    u8
%     bind        u8          绑定状态
%     )


% % =========================
% % 爬塔重置提示
% % 协议号：49008
% S >> C:


% % ==========================================================================
% % 伏魔塔
% % ==========================================================================
%% 请求伏魔塔数据
%% 协议号：49020
%% C >> S：
%% 无参

%% S >> C：
%% Floor 		u16		当前最高已通关层数
%% Times		u16		可用挑战次数
%% LastTimeRestore u32	上次回复挑战次数时间戳

%% 请求挑战伏魔塔
%% 协议号：49021
%% C >> S：
%% Floor 		u16		要挑战的层数











