%% =========================================================
%% 50 秘境&幻境
%% =========================================================
%%-----------打开大秘境界面---------
-define(PT_MYSTERIES_OPEN, 50001).
%% 协议号: 50001
%% C >> S:
%%
%%
%%  S >> C:
%%      Count          u8     	   今日剩余挑战次数
%%      no 			   u32         秘境难度编号，当天第一次进入返回0
%%      array{
%%			arr_1      u8          1代表开启，0代表关闭，难度简单
%%			arr_2      u8          1代表开启，0代表关闭，难度困难
%%			arr_3      u8          1代表开启，0代表关闭，难度噩梦
%%  		}
%%
%%

%%-----------进入哪个大秘境关卡---------
-define(PT_ENTER_MYSTERIES, 50002).
%% 协议号: 50002
%% C >> S:
%%      no	   u32          秘境难度编号
%%
%%  S >> C:
%% 		Current            u16          当前打到最新关卡，一场都没打过就返回0
%%     	array{
%%          num        	   u16          精英关卡编号
%%			}



%%-----------进入大秘境第几关---------
-define(PT_PLAY_ON_MYSTERIES, 50003).
%% 协议号: 50003
%% C >> S:
%%      no	   		   u32         秘境难度编号
%%


%%-----------大秘境战斗结果---------
-define(PT_MYSTERIES_FIGHT_RESULT, 50004).
%% 协议号: 50004
%% S >> C:
%%      current_level          	u16		    当前玩家打完的关卡
%% 		point          		   	u8          打赢加的分数
%%		flag  					u16			是否开启奖励面板 0 不开启 / 1 开启
%%		no 						u32			秘境/幻境的难度编号

%%-----------大秘境通关翻牌奖励---------
-define(PT_MYSTERIES_REWARD, 50005).
%% 协议号: 50005
%% C >> S:
%%
%% S >> C:
%%		goods_no      u32        物品编号
%%		num           u16		 物品数量
%%

%%-------------秘境重置-------------
-define(PT_MYSTERIES_TIME_RESET, 50006).
%% 协议号: 50006
%% C >> S:
%%
%% S >> C:
%%		count           u8	  	剩余可重置次数
%%

%%-------------------幻境部分------------------------

%%-----------打开幻境界面---------
-define(PT_MIRAGE_OPEN, 50011).
%% 协议号: 50011
%% C >> S:
%%
%%
%%  S >> C:
%%      Count          u8     	   今日剩余挑战次数
%%      no 			   u32         秘境难度编号，当天第一次进入返回0
%%      array{
%%			arr_1      u8          1代表开启，0代表关闭，难度简单
%%			arr_2      u8          1代表开启，0代表关闭，难度困难
%%			arr_3      u8          1代表开启，0代表关闭，难度噩梦
%%  		}
%%

%%-----------进入哪个幻境关卡---------
-define(PT_ENTER_MIRAGE, 50012).
%% 协议号: 50012
%% C >> S:
%%      no	   	   		   u32          幻境难度编号
%%
%%  S >> C:
%%      no	   	   		   u32          幻境难度编号
%% 		Current            u16          当前打到最新关卡，一场都没打过就返回0
%%      array{
%%				num        u16          精英关卡编号
%%			}



%%-----------进入幻境第几关---------
-define(PT_PLAY_ON_MIRAGE, 50013).
%% 协议号: 50013
%% C >> S:
%%      no	   		   u32          幻境难度编号
%%


%%-----------幻境战斗结果---------
-define(PT_MIRAGE_FIGHT_RESULT, 50014).
%% 协议号: 50014
%% S >> C:
%%      current_level          	u16		    当前玩家打完的关卡
%% 		point          		   	u8          打赢加的分数
%%		flag  					u16			是否开启奖励面板 0 不开启 / 1 开启
%%		no 						u32			秘境/幻境的难度编号
%%

%%-----------打开幻境解锁面板---------
-define(PT_MIRAGE_UNLOCK_PANEL_OPEN, 50015).
%% 协议号: 50015
%% S >> C:
%%      all_count		 		u8			对应秘境总关卡数
%%		count		 			u8			当前关对应秘境通关数
%%      level_no                u32         对应幻境难度编号
%%

%%-----------秘境/幻境重置---------
-define(PT_MIRAGE_TIME_RESET, 50016).
%% 协议号: 50016
%% C >> S:
%%
%% S >> C:
%%		count           u8	  		剩余可重置次数
%%

%%-------------幻境解锁-------------
-define(PT_MIRAGE_UNLOCK, 50017).
%% 协议号: 50017
%% C >> S:
%%      level_no        u32     	关卡编号
%% S >> C:
%%		final 			u8           1成功，0失败
%%

%%-------------通知队员进入幻境-------------
-define(PT_NOTIFY_TEAM_IN_MIRAGE, 50018).
%% 协议号: 50018
%% S >> C:
%%      id           u64        通知队员等待进入
%%

%%-------------通知队员信息-------------
-define(PT_NOTIFY_TEAM_MESSAGE, 50019).
%% 协议号: 50019
%% C >> S:
%%      agree        u8     	1同意 0不同意
%% S >> C:
%%      type           1 不同意进入 2 退队 3 待定。。。
%%      array{
%%          name           string        玩家名称
%%      }
%%

%%-------------通知队长队员等级不足-------------
-define(PT_NOTIFY_LEADER_LV_NOT_ENOUGH, 50020).
%% 协议号: 50020
%% S >> C:
%%      array{
%%          name           string        玩家名称
%%      }
%%

%%-------------0点提示重置面板-------------
-define(PT_NOTIFY_RESET_PANEL, 50021).
%% 协议号: 50021
%% S >> C:
%%      flag            u8              1秘境 2秘境
%%
%%

%%-------------关闭幻境面板-------------
-define(PT_MIRAGE_CLOSE, 50030).
%% 协议号: 50030
%% C >> S:
%%

%%-------------开启转生-------------
-define(PT_START_REINCARNATION, 50050).
%% 协议号: 50050
%% C >> S:
%%

%%-------------经验兑换转生货币--------------
-define(PT_EXP_EXCHANGE_REINCARNATION, 50051).
%% 协议号: 50051
%% C >> S:
%%		count       u32  	 兑换数量
%%

%%-------------转生货币购买物品--------------
-define(PT_REINCARNATION_PURCHASE_GOODS, 50052).
%% 协议号: 50052
%% C >> S:
%%		no  		u8 	 编号
%%		count       u32  	 购买数量
%%
%%