%% =========================================================
%% 57 副本
%% =========================================================

%% state:  0->失败/未知错误  1->成功/可进入  3->人数/队伍限制 4->前置难度没通关 5->cd 6-> 副本次数用光 7-> 没有副本道具消耗

% =========================
% 创建并进入副本
% 协议号：57001
% C >> S:
%   no      u32         副本编号
% S >> C:
%   no      u32         副本编号
%   array(
%       Id  u64         玩家id
%       state   u8          状态
%   )


% =========================
% 退出副本
% 协议号：57002
% C >> S:
% S >> C:
%   state   u8          状态


% =========================
% 查询副本
% 协议号：57003
% C >> S:
%   array(
%     no      u32         副本编号
%   )
% S >> C:
%   array(
%     no      u32         副本编号
%     state   u8          状态
%     times   u16         次数
%     reward_times   u16         已领奖次数
%	  pass u8		 通关状态
%   )


% =========================
% 进入副本确认
% 协议号：57004
% C >> S:
%   flag   u8       0->否 1->是 2->不使用英雄令       
% S >> C:
%   flag   u8       0->进入副本失败 1->成功
%   array(
%       Id  u64         点否的玩家id
%   state   u8      是否要使用英雄令 1:否 2:是
%   ) 

% =========================
% 显示进入副本确认
% 协议号：57005
% S >> C:
%   No      u32     副本编号
%   state   u8      是否要使用英雄令 0:是 1:否


% =========================
% 通知客户端进入副本
% 协议号：57006
% S >> C: 
%     no      u32     副本编号
%     time    u32     剩余时间


% =========================
% 通知通关奖励
% 协议号：57007
% S >> C: 
%     ======
%     评分细则
%     ======
%     lv            u8      评分等级
%     bout          u16     回合数
%     bout_points   u32     回合分数
%     dead          u16     死亡数
%     dead_points   u32     死亡分数


% =========================
% 再来一箱
% 协议号：57008
% C >> S:
%
% S >> C: 
%     state   u8      状态
%     quality   u8      箱子品质(1->钻;2->金;3->银;4->铜)


%     array(        (废弃)
%         itemNo  u32     物品编号
%         num     u16     数量
%         )


% =========================
% 回复CD
% 协议号：57009
% C >> S:
%   group      u16         副本所属组 
% S >> C:
%     group      u16         副本所属组 
%     times      u16         次数 

% =========================
% 通知副本时间到期
% 协议号：57010
% S >> C:


% =========================
% 爬塔副本进入下一层
% 协议号：57011
% C >> S:


% =========================
% 通知等待队员确认进入副本
% 协议号：57012
% S >> C:


% =========================
% 领取箱子奖励  (new)
% 协议号：57013
% C >> S:

% S >> C:
%     array(        
%         itemNo  u32     物品编号
%         num     u16     数量
%         quality u8      品质
%         GoodsId u64     物品ID
%         bind        u8          绑定状态
%         )

% =========================
% 世界BOSS血条
% 57101
% C >> S:
% S >> C:
%    BossNo    u32     
%    maxHp     u32          Boss最大血量
%    curHp     u32          Boss当前血量


% =========================
% 世界BOSS参与人数
% 57102
% C >> S:
% S >> C:
%    num        u32 


% =========================
% 世界BOSS 副本界面排名信息
% 57103
% C >> S:
% S >> C:
%    TotalDamage    u32         总伤害量
%    array(
%       roleId      u64
%       roleName    string
%       damage      u32         伤害值
%    )


% =========================
% 副本调试信息显示
% 协议号：57900

% S >> C:
%   msg     string      调试信息


% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
% 
