%% =========================================================
%% 58 系统活跃度
%% =========================================================

% =========================
% 查看系统活跃度信息
% 协议号：58001
% C >> S:
% S >> C:
%     array(
%         sys         u16         系统编号
%         acti_times  u16         活跃度次数
%         times       u16         当前参与次数
%         max_times   u16         总次数
%         state       u8          0->完结 1->进行中
%         )


% =========================
% 查看奖励信息
% 协议号：58002
% C >> S:
% S >> C:
    % array(
    %     reward_index    u16     奖励序号
    %     reward_id       u32     奖励ID
    %     point           u16     领取该奖励需要的活跃点数
    %     state           u8      0->未领取 1->已领取
    %     )

% =========================
% 领取奖励
% 协议号：58003
% C >> S:
%     reward_index    u16     奖励序号    

% =========================
% 活跃变化
% 协议号：58004 
% S >> C:
%         sys         u16         系统编号
%         times       u16         活跃度次数
%         curtimes    u16         当前次数


% =========================
% 活动开启
% 协议号：58005 
% C >> S:
% S >> C:
%         sys         u16         系统编号
%         state       u8          开启状态 0->新开启 1->继续 2->结束
%         type        u8          0:正常开启  1:升级开启


%%-----------------------------获取找回经验信息-------------------------------------
-define(PT_ACT_JINGYAN,  58006).

% 协议号：58006
% C >> S:
%       仅发协议号
% S >> C:
%       array(
%           no                  u8          活动编号
%           count               u16         可领取的次数，没有则为0
%           array{
%               good_no         u32         单次奖励的道具编号
%               num             u32         单次的数量
%           }
%       )
%

%%-----------------------------找回经验-------------------------------------
-define(PT_ACT_JINGYAN_AWARD,  58007).

% 协议号：58007
% C >> S:
%       no                  u8          活动编号，0表示一键找回
%       type                u8          类型 1= 免费，2=付费
% S >> C:
%       array{
%           no                  u8          活动编号
%           type                u8          类型 1= 免费，2=付费
%       }
%       no                  u8          活动编号，0表示一键找回
%

%%-----------------------------找回经验每日首次登录标签-------------------------------------
-define(PT_ACT_JINGYAN_RESET,  58008).
% 协议号：58008
% C >> S:

% 协议号：58008
% S >> C:
%       is_first                  u8          是否当日首次登录，1：不是，2：是
%

