%% =========================================================
%% 62   恶梦爬塔
%% =========================================================

% =========================
% 恶梦爬塔信息
% 协议号：62001
% C >> S:

% S >> C: 
%     tower_no      u32     当前副本编号[100002, 100003, 100004], 0表示没有进入过任何噩梦爬塔  
%     cur_floor     u16     当前层数
%     max_floor     u16     总层数
%     chal_times    u8      恶梦爬塔剩余挑战次数
%     best_floor    u16     最好进度层数
    

% % =========================
% % 恶梦爬塔副本内界面信息
% % 协议号：62002
% S >> C:
%     tower_no      u32     当前副本编号[100002, 100003, 100004], 0表示没有进入过任何噩梦爬塔  
%     cur_floor       u16     当前层数
%     chal_times      u8      当前BOSS挑战次数
%     max_chal_times  u8      最大BOSS挑战次数
%     buy_times       u8      当前购买次数
%     max_buy_times   u8      最大购买次数
    
% % =========================
% % 进入恶梦爬塔副本
% % 协议号：62003
% C >> S:
%     type            u8      0代表普通进入，1代表普通跳层，2代表完美跳层
%     cur_floor       u16     进入的层数
% S >> C:
% 这里是跳层所获得的奖励
% array(
%     GoodsId     u64
%     GoodsNo     u32
%     GoodsNum    u32
%     GoodsQua    u8
%     bind        u8          绑定状态
%     )
%
%     (-define(DEFAULT_STATE, 0).
% -define(ERROR, 0).
% -define(SUCCESS, 1).
% -define(LV_NOT_ENGOUTH, 2).
% -define(TEAM_LIMIT, 3).
% -define(DUN_LIMIT, 4).
% -define(CD_LIMIT, 5).
% -define(VIP_LIMIT, 6).   
% -define(FLOOR_NOT_REACH, 7). 未通关此层        

% % =========================
% % 清除进度
% % 协议号：62004 
% C >> S: 

% S >> C:
%     flag    u8      状态
%     chal_times    u8      恶梦爬塔剩余挑战次数
    
    
% % =========================
% % 添加挑战次数
% % 协议号：62005
% C >> S:
%     flag    u8      1->是；0->否


% % =========================
% % 恶梦爬塔战斗失败
% % 协议号：62006
% S >> C:
% 

% % =========================
% % 恶梦爬塔奖励反馈
% % 协议号：62007
% S >> C:
% array(
%     GoodsId     u64
%     GoodsNo     u32
%     GoodsNum    u32
%     GoodsQua    u8
%     bind        u8          绑定状态
%     )


% % =========================
% % 恶梦爬塔重置提示
% % 协议号：62008
% S >> C: