%%%------------------------------------
%%% @Desc: 场景配置数据
%%%        本文件由地图编辑器生成
%%%------------------------------------
-module(data_scene).
-export([get_no_list/0, get/1]).
-include("scene.hrl").
-include("debug.hrl").


%% 获取所有场景的编号列表
get_no_list() ->
[10000,10001,1101,1102,1103,1104,1105,1106,1201,1202,1203,1204,1303,1304,1305,1306,1307,1308,13081,1309,1310,1311,1312,2102,3101,3102,3201,3301,3501,3511,3512,3513,3601,3701,4102,5001,6001,7001,7002,7003,7004,9001,9002,9003].

get(10000) ->
	#scene_tpl{
		no = 10000,                             % 编号
		name = <<"妖界宝库">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 36,                           % 宽度
		height = 32,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(10001) ->
	#scene_tpl{
		no = 10001,                             % 编号
		name = <<"百家岁试">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 42,                           % 宽度
		height = 23,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1101) ->
	#scene_tpl{
		no = 1101,                             % 编号
		name = <<"法家">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 161,                           % 宽度
		height = 90,                          % 高度
		npcs = [{2059,61,39},{1046,59,20},{2071,98,38},{2077,37,26},{2130,94,20},{2189,136,5}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{31,125,24,19,11}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{120,95,33,5,3}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{24,46,11}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1102) ->
	#scene_tpl{
		no = 1102,                             % 编号
		name = <<"玄天宗师门">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 118,                           % 宽度
		height = 118,                          % 高度
		npcs = [{1001,17,107},{20001,23,75},{20007,50,105},{20013,75,109},{20019,92,103},{20031,104,54},{20037,42,30},{20043,75,22},{20163,23,22},{20159,87,60},{20025,62,66}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1006,108,8}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1103) ->
	#scene_tpl{
		no = 1103,                             % 编号
		name = <<"道家">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 130,                           % 宽度
		height = 75,                          % 高度
		npcs = [{1005,55,41},{2061,53,25},{1048,14,31},{2073,21,21},{2079,27,21},{2132,17,20},{2191,24,19},{2154,52,10},{5026,29,3}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{51,41,2,45,6},{52,77,9,19,15}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{3004,58,11,6,6},{3005,45,6,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{10,96,29}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1104) ->
	#scene_tpl{
		no = 1104,                             % 编号
		name = <<"兵家">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 70,                           % 宽度
		height = 52,                          % 高度
		npcs = [{1002,52,39},{2058,39,36},{1045,26,34},{2076,44,30},{2070,36,27},{2129,30,23},{2188,26,25}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{21,10,5,18,7}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{13,34,10}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1105) ->
	#scene_tpl{
		no = 1105,                             % 编号
		name = <<"儒家">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 130,                           % 宽度
		height = 78,                          % 高度
		npcs = [{1006,29,44},{2062,92,40},{1049,95,12},{2080,65,22},{2074,68,22},{2133,67,20},{2192,62,20}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{61,102,60,25,21}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{26,118,3}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1106) ->
	#scene_tpl{
		no = 1106,                             % 编号
		name = <<"墨家">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 148,                           % 宽度
		height = 72,                          % 高度
		npcs = [{1001,55,36},{2057,34,33},{1044,89,31},{2075,70,53},{2069,73,50},{2128,73,54},{2187,75,50}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{11,76,31,7,5},{12,68,31,6,8},{13,81,22,10,5},{14,97,4,13,9}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{17,116,34}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1201) ->
	#scene_tpl{
		no = 1201,                             % 编号
		name = <<"上古迷宫">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 87,                           % 宽度
		height = 59,                          % 高度
		npcs = [{2032,23,37},{2904,51,15},{2905,41,20},{2906,29,4},{2118,59,30},{2053,29,15},{2119,75,25}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{61,19,5,5,4}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{28,10,43}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1202) ->
	#scene_tpl{
		no = 1202,                             % 编号
		name = <<"赵家私牢">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 106,                           % 宽度
		height = 131,                          % 高度
		npcs = [{2043,24,16},{5010,96,155},{5013,24,77},{2120,61,38},{2403,42,36},{2404,42,36},{2405,42,36}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{31,16,24}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1203) ->
	#scene_tpl{
		no = 1203,                             % 编号
		name = <<"昆仑秘境">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 156,                           % 宽度
		height = 133,                          % 高度
		npcs = [{20069,144,96},{20070,64,118},{20071,8,75},{20072,128,74},{20073,137,108},{20074,147,41},{20075,91,22},{20076,10,38},{20077,82,69},{20078,30,33},{20110,142,72},{20111,95,13},{20112,31,94},{20137,136,72},{20138,63,79},{20139,65,27},{30006,140,95},{30007,14,114},{30008,124,44},{30010,10,64}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{100,79,76,6,6},{101,129,28,6,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1,80,67,6,6},{2,75,23,6,6},{3,19,105,6,6},{4,32,33,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1002,94,119}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1204) ->
	#scene_tpl{
		no = 1204,                             % 编号
		name = <<"海底世界">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 134,                           % 宽度
		height = 55,                          % 高度
		npcs = [{2139,92,35},{2142,109,26},{2143,109,25},{5025,24,13},{2152,46,17},{2153,92,34}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{75,29,5,5,5},{76,94,19,5,6},{3003,28,13,6,6},{3008,115,27,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{72,29,49}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1303) ->
	#scene_tpl{
		no = 1303,                             % 编号
		name = <<"盘龙岭">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 125,                           % 宽度
		height = 147,                          % 高度
		npcs = [{20098,52,55},{20099,56,57},{20101,72,17},{20102,67,17},{20104,25,86},{20105,21,88},{20169,86,82},{20126,48,44},{20125,42,46},{20128,87,74},{20127,81,76},{20130,66,115},{20129,62,115},{20147,58,57},{20148,61,14},{20149,33,90},{20151,113,44},{20154,68,76},{20157,31,49},{30016,33,58},{30017,114,52},{30018,51,114},{30019,16,86}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{100,101,44,6,6},{101,27,83,6,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1,48,53,7,5},{2,67,16,8,5},{3,23,85,5,5},{4,40,46,6,6},{5,78,74,6,6},{6,57,114,6,6},{7,101,45,6,6},{8,68,16,6,6},{9,75,74,6,6},{10,26,85,6,6},{11,37,51,6,6},{12,55,105,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1004,19,24}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1304) ->
	#scene_tpl{
		no = 1304,                             % 编号
		name = <<"长安城">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 218,                           % 宽度
		height = 211,                          % 高度
		npcs = [{1014,140,198},{1024,183,46},{1025,203,36},{1028,194,39},{2025,243,86},{2026,250,78},{1017,40,104},{2028,70,171},{2030,237,149},{2031,89,110},{2065,234,49},{1031,207,13},{1033,160,54},{1016,173,129},{1021,132,115},{1054,236,88},{1018,220,99},{1057,35,175},{1067,146,138},{1029,68,28},{10011,85,37},{1022,124,139},{10036,79,33},{10037,74,30},{10038,224,94},{10039,229,92},{20049,81,81},{20050,126,62},{20051,117,62},{20052,171,116},{20054,9,102},{20056,16,87},{20065,200,147},{20066,198,163},{20067,102,190},{20068,158,113},{1020,140,118},{2046,122,118},{1027,188,42},{20131,65,71},{20136,189,149},{2028,48,160},{20171,101,40},{20173,116,32},{20172,109,36},{20176,162,39},{20174,153,37},{20175,146,31},{1068,129,31},{1035,90,125},{1018,133,136}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{18039,30,49,6,6},{2,22,88,6,6},{3,50,14,6,6},{5,197,128,6,6},{1,152,31,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1305) ->
	#scene_tpl{
		no = 1305,                             % 编号
		name = <<"北冥禁地">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 156,                           % 宽度
		height = 118,                          % 高度
		npcs = [{20057,107,40},{20060,71,80},{20061,50,99},{20062,136,101},{20063,135,99},{20064,132,102},{20106,38,71},{20107,132,103},{20108,132,61},{20109,145,23},{20134,17,62},{20135,39,59},{30011,123,34},{30012,71,58},{30013,53,107},{30014,114,109}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{100,6,33,6,6},{101,48,56,6,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1,71,17,6,6},{2,7,59,6,6},{3,41,69,6,6},{4,23,63,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1001,24,12}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1306) ->
	#scene_tpl{
		no = 1306,                             % 编号
		name = <<"江南水乡">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 156,                           % 宽度
		height = 133,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1100,46,71,6,3},{1101,105,42,6,3},{1102,85,65,6,3},{1104,27,18,6,3},{1105,93,71,6,2},{1106,75,65,6,3},{1103,106,42,6,3}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{79,31,32}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1307) ->
	#scene_tpl{
		no = 1307,                             % 编号
		name = <<"宝库陵墓">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 140,                           % 宽度
		height = 105,                          % 高度
		npcs = [{2019,109,80},{2018,120,75},{2020,115,21},{5004,43,71},{2021,46,51},{2022,63,66},{5005,15,85},{5011,82,25},{2901,29,23},{2902,106,17},{2903,90,77},{2117,114,21},{5021,36,58},{5028,24,22},{8001,65,29}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{201,25,1,6,26},{202,52,2,42,20},{203,102,2,34,8},{204,92,57,24,21},{205,59,48,31,20},{206,5,70,27,12},{207,78,58,41,20},{208,59,55,12,11},{209,41,24,20,26},{210,24,69,6,25},{211,33,47,8,10},{212,34,25,26,7},{213,2,22,38,4}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{31,40,44,8,5}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [{50041,6,21,6,6},{50042,25,15,6,6},{50043,25,5,6,6},{50044,103,7,6,6},{50045,76,17,6,6},{50046,70,85,4,4},{50047,45,27,7,7},{50048,52,7,6,6},{50049,60,42,6,6},{50050,81,49,6,6},{50051,105,59,6,6},{50052,18,68,6,6},{50053,98,69,6,6},{50054,113,64,6,6},{50055,34,48,6,6},{50056,80,68,6,6},{50057,26,80,6,6},{50058,63,56,7,5},{50059,99,49,6,6},{50060,119,19,5,5},{50061,128,4,6,6},{50062,93,65,6,6},{50063,47,2,6,6},{50064,52,43,6,6},{50065,52,17,6,6},{50066,5,73,6,6},{50067,110,67,6,6},{50068,76,59,6,6},{50069,89,49,6,6},{50070,96,6,6,6}],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{6,18,97},{20,121,94}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1308) ->
	#scene_tpl{
		no = 1308,                             % 编号
		name = <<"赵国监牢">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 314,                           % 宽度
		height = 90,                          % 高度
		npcs = [{2035,250,37},{2034,244,51},{2033,198,39},{2036,179,40},{2037,167,45},{5007,50,23},{5006,125,39},{2907,79,50},{2908,136,74},{2909,28,43},{2038,138,47},{2039,90,50},{2041,27,63},{2040,56,13},{2044,92,39},{2045,55,25},{2042,202,69},{5008,91,67},{5009,171,69},{2094,160,73},{2068,134,53},{5012,82,64},{2121,112,62},{5023,215,75},{5024,115,55},{8002,27,54},{2400,246,70},{2401,246,70},{2402,247,70}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{230,223,21,20,17},{231,31,46,29,22},{232,74,48,44,16},{233,78,21,14,49},{235,78,28,106,8},{236,90,47,28,17},{237,38,57,34,13},{238,196,60,15,7},{239,201,25,21,9},{240,177,3,12,9},{241,35,27,15,13},{301,46,47,12,5},{302,56,41,24,6},{303,112,29,13,11},{304,133,43,11,5},{305,166,61,7,6},{306,39,64,12,6},{307,95,58,11,6},{308,115,58,6,6},{309,172,61,7,5},{310,202,59,7,9},{501,52,63,5,5},{502,75,60,6,6},{503,63,39,6,6},{504,136,42,5,5},{505,228,32,5,5},{506,234,35,6,6},{507,254,29,6,6},{508,223,24,6,6},{234,241,27,11,7}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{41,78,54,9,5},{42,164,36,13,4},{44,122,37,6,4},{43,81,44,7,4}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [{50071,106,54,6,6},{50072,96,58,6,6},{50073,80,64,6,5},{50074,58,63,5,5},{50075,47,64,6,6},{50076,33,60,6,6},{50077,85,29,6,6},{50078,112,36,6,6},{50079,197,60,6,6},{50080,207,27,6,6},{50081,62,41,6,6},{50082,245,67,5,5},{50083,221,17,6,6},{50084,242,25,6,6},{50085,167,61,6,6},{50086,80,25,5,4},{50087,228,21,6,6},{50088,209,65,6,6},{50089,84,29,6,6},{50090,106,31,5,5},{50091,236,35,6,6},{50092,168,34,6,6},{50093,135,37,6,6},{50094,99,56,6,6},{50095,237,23,6,6},{50096,179,4,6,6},{50097,167,35,6,6},{50098,234,26,6,6},{50099,117,35,6,6},{50100,202,60,6,6}],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{8,270,42},{30,22,75},{55,87,12},{15,76,77},{18,125,80}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(13081) ->
	#scene_tpl{
		no = 13081,                             % 编号
		name = <<"南海归虚">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 125,                           % 宽度
		height = 80,                          % 高度
		npcs = [{20080,80,60},{20081,80,58},{20083,59,27},{20084,51,26},{20086,94,9},{20087,98,9},{20167,28,8},{20114,75,55},{20113,84,55},{20116,35,13},{20115,40,17},{20118,115,31},{20117,108,32},{20141,72,62},{20142,48,25},{20143,101,8},{30020,101,19},{30009,49,39},{30015,104,67},{30002,47,22}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{100,56,54,6,6},{101,65,22,6,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1,75,56,5,5},{2,53,26,5,4},{3,90,8,6,6},{4,84,52,6,6},{5,38,15,6,6},{6,106,29,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1003,26,63}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1309) ->
	#scene_tpl{
		no = 1309,                             % 编号
		name = <<"秦军宿营">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 167,                           % 宽度
		height = 178,                          % 高度
		npcs = [{2098,26,66},{2099,36,135},{2114,66,29},{2104,124,151},{2103,75,22},{2100,128,128},{2101,125,20},{2107,143,79},{2106,102,82},{2127,54,106},{2110,21,35},{2111,48,30},{2123,33,67},{2913,16,59},{2914,60,23},{2915,53,135},{5014,139,32},{5015,61,102},{5018,39,29},{5019,53,25},{5020,16,53},{5022,121,88},{8004,72,143},{2149,144,129}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{321,21,25,22,7},{322,51,19,29,11},{323,115,13,28,11},{324,13,45,13,18},{325,125,38,13,35},{326,127,84,12,23},{327,131,102,9,27},{328,48,95,23,8},{329,21,59,8,10},{330,5,70,12,10},{521,22,62,6,6},{522,48,17,6,6},{523,133,110,6,6},{524,126,85,5,5},{525,126,51,6,3},{526,134,69,5,5},{527,51,95,5,6},{528,66,130,5,3}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{91,23,135,5,4},{92,55,22,12,4},{93,70,20,8,4},{94,71,23,7,2},{95,111,78,5,4},{96,120,83,6,2},{97,19,61,11,4},{98,37,23,10,6},{99,50,19,10,6},{100,45,130,10,6},{1107,135,23,6,4},{3001,139,125,6,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [{50131,25,115,6,6},{50132,22,61,6,6},{50133,20,41,6,6},{50134,35,27,5,2},{50135,50,20,6,6},{50136,66,22,6,6},{50137,112,77,1,6},{50138,35,63,6,2},{50139,134,22,6,6},{50140,127,36,7,3},{50141,128,51,6,6},{50142,132,101,6,6},{50143,94,76,6,2},{50144,107,80,6,3},{50145,129,65,6,6},{50146,22,26,6,6},{50147,27,58,6,6},{50148,13,65,6,6},{50149,24,63,6,6},{50150,23,59,6,6}],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{7,10,149},{9,42,11},{46,147,11},{25,86,90},{68,76,36}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1310) ->
	#scene_tpl{
		no = 1310,                             % 编号
		name = <<"蓬莱云顶">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 156,                           % 宽度
		height = 135,                          % 高度
		npcs = [{20089,108,124},{20090,106,125},{20092,58,66},{20093,62,67},{20095,13,104},{20096,8,106},{20168,96,88},{20120,125,34},{20119,119,36},{20122,79,19},{20121,90,21},{20124,66,40},{20123,72,41},{20144,104,125},{20145,69,65},{20146,6,105},{30001,139,80},{30003,138,43},{30004,52,39},{30005,70,104}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{100,116,74,6,6},{101,70,102,6,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1,100,122,13,6},{2,52,64,10,6},{3,8,102,8,4},{4,112,34,8,4},{5,83,16,8,4},{6,70,38,8,4},{1011,24,40,8,4}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1005,141,120}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1311) ->
	#scene_tpl{
		no = 1311,                             % 编号
		name = <<"梦幻仙境">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 254,                           % 宽度
		height = 187,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{331,44,13,12,4},{333,147,10,7,9},{332,81,15,10,4},{334,121,45,9,12},{335,76,37,9,5},{336,30,65,9,8},{337,77,54,9,7},{338,157,41,6,7},{339,123,16,11,7},{340,56,63,9,5},{531,29,65,8,6},{532,86,49,8,5},{533,131,54,6,6},{534,133,24,6,6},{535,159,8,6,6},{536,115,17,6,4},{537,72,14,4,4},{538,78,38,6,3}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{72,110,17,11,6},{73,146,41,13,5},{74,140,57,13,6},{77,88,49,12,6}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{60,26,20},{61,56,37},{63,176,19}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(1312) ->
	#scene_tpl{
		no = 1312,                             % 编号
		name = <<"银潮海谷">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 159,                           % 宽度
		height = 226,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{1120,103,13,6,6},{1121,48,15,13,6},{1122,9,22,11,6},{1123,40,35,11,6},{1124,72,12,10,12},{1125,102,72,11,6},{1126,151,64,11,6},{1127,153,41,11,6},{1128,150,21,11,6},{1129,166,21,11,6},{551,26,68,6,6},{552,45,60,6,6},{553,67,57,6,6},{554,86,46,5,6},{555,106,75,6,6},{556,150,65,6,6},{557,153,41,6,6},{558,107,16,6,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [{1109,66,57,9,7},{1110,85,45,6,4},{1111,87,56,6,4}],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [{50161,109,76,11,7},{50162,141,67,13,8},{50163,164,59,11,7},{50164,154,51,13,7},{50165,140,28,12,7},{50166,179,23,9,6},{50167,129,23,10,8},{50168,85,14,9,10},{50169,38,23,15,4},{50170,63,12,7,10},{50171,48,48,7,5},{50172,39,61,10,7},{50173,10,67,12,6},{50174,12,44,9,9},{50175,9,16,11,5},{50176,85,46,9,7},{50177,63,48,9,6},{50178,77,62,6,6},{50179,3,32,9,8},{50180,22,22,6,6}],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{80,127,9},{81,163,80}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(2102) ->
	#scene_tpl{
		no = 2102,                             % 编号
		name = <<"风清门师门">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 118,                           % 宽度
		height = 118,                          % 高度
		npcs = [{1002,17,108},{20002,23,75},{20008,51,106},{20014,75,110},{20020,92,103},{20160,86,61},{20026,62,65},{20032,103,54},{20038,46,31},{20044,75,23},{20164,23,22}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1007,108,8}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3101) ->
	#scene_tpl{
		no = 3101,                             % 编号
		name = <<"宠物副本">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 93,                           % 宽度
		height = 71,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3102) ->
	#scene_tpl{
		no = 3102,                             % 编号
		name = <<"阎罗殿师门">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 118,                           % 宽度
		height = 118,                          % 高度
		npcs = [{1003,16,107},{20003,23,75},{20009,50,107},{20015,74,110},{20021,92,102},{20161,87,61},{20027,62,66},{20033,103,54},{20039,47,31},{20045,79,23},{20165,24,21}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1008,108,8}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3201) ->
	#scene_tpl{
		no = 3201,                             % 编号
		name = <<"翅膀副本">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 93,                           % 宽度
		height = 115,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3301) ->
	#scene_tpl{
		no = 3301,                             % 编号
		name = <<"镇妖塔">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 89,                           % 宽度
		height = 67,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3501) ->
	#scene_tpl{
		no = 3501,                             % 编号
		name = <<"帮派副本">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 153,                           % 宽度
		height = 118,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{501,51,59,22,27},{502,76,58,22,27},{503,51,31,24,33},{504,77,31,22,33},{505,73,45,55,26},{506,40,37,30,42},{507,31,40,31,24},{508,84,44,41,15},{509,115,61,12,10},{510,22,46,24,23}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3511) ->
	#scene_tpl{
		no = 3511,                             % 编号
		name = <<"冰封战场">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 101,                           % 宽度
		height = 64,                          % 高度
		npcs = [{9001,18,36},{9002,41,49},{9003,71,41},{9004,66,24},{9005,33,22}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3512) ->
	#scene_tpl{
		no = 3512,                             % 编号
		name = <<"无尽战场">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 87,                           % 宽度
		height = 64,                          % 高度
		npcs = [{9006,20,13},{9007,77,28},{9008,27,50}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3513) ->
	#scene_tpl{
		no = 3513,                             % 编号
		name = <<"帮派战">>,                  % 名字
		type = 2,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 36,                           % 宽度
		height = 32,                          % 高度
		npcs = [{9009,18,22}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3601) ->
	#scene_tpl{
		no = 3601,                             % 编号
		name = <<"挑战魔龙">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 112,                           % 宽度
		height = 75,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(3701) ->
	#scene_tpl{
		no = 3701,                             % 编号
		name = <<"兵临城下">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 56,                           % 宽度
		height = 37,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(4102) ->
	#scene_tpl{
		no = 4102,                             % 编号
		name = <<"神医谷师门">>,                  % 名字
		type = 4,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 118,                           % 宽度
		height = 118,                          % 高度
		npcs = [{1004,17,108},{20004,23,75},{20010,50,107},{20016,75,110},{20022,92,102},{20162,87,61},{20034,103,54},{20046,81,23},{20166,24,22},{20040,46,30},{20028,61,65}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{1009,108,8}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(5001) ->
	#scene_tpl{
		no = 5001,                             % 编号
		name = <<"帮派">>,                  % 名字
		type = 5,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 156,                           % 宽度
		height = 95,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(6001) ->
	#scene_tpl{
		no = 6001,                             % 编号
		name = <<"家园">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 93,                           % 宽度
		height = 67,                          % 高度
		npcs = [{10015,11,48},{10016,15,49},{10017,15,46},{10018,18,48},{10019,19,44},{10020,22,46},{10021,45,54},{10022,69,23},{10023,70,49}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{601,22,24},{701,27,58},{801,83,26}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(7001) ->
	#scene_tpl{
		no = 7001,                             % 编号
		name = <<"百草谷">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 42,                           % 宽度
		height = 43,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{901,33,17}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(7002) ->
	#scene_tpl{
		no = 7002,                             % 编号
		name = <<"妖风山">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 106,                           % 宽度
		height = 81,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{902,10,9}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(7003) ->
	#scene_tpl{
		no = 7003,                             % 编号
		name = <<"幽月涧">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 98,                           % 宽度
		height = 84,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{903,59,74}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(7004) ->
	#scene_tpl{
		no = 7004,                             % 编号
		name = <<"九黎幻境">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 93,                           % 宽度
		height = 75,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [{904,78,59}] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(9001) ->
	#scene_tpl{
		no = 9001,                             % 编号
		name = <<"小黑屋">>,                  % 名字
		type = 1,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 31,                           % 宽度
		height = 20,                          % 高度
		npcs = [{1086,24,5},{1030,21,13}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(9002) ->
	#scene_tpl{
		no = 9002,                             % 编号
		name = <<"泡点">>,                  % 名字
		type = 6,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 75,                           % 宽度
		height = 65,                          % 高度
		npcs = [{10001,65,42},{10002,9,32},{10003,31,24},{10004,51,53},{10005,13,49},{10006,35,38}],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [{401,14,42,11,8},{403,23,41,10,6},{404,32,41,10,7},{405,44,37,11,7},{406,21,29,10,6},{407,24,34,12,7},{408,30,28,12,8},{409,36,33,11,8},{410,40,30,12,8},{402,16,35,10,6}],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};

get(9003) ->
	#scene_tpl{
		no = 9003,                             % 编号
		name = <<"装备副本">>,                  % 名字
		type = 3,                             % 类型，1：城市，2:野外，3：副本，4：师门，5：帮派，6：乱斗，7：监狱
		width = 46,                           % 宽度
		height = 27,                          % 高度
		npcs = [],  % 功能NPC列表，格式：[{NPC编号, X坐标, Y坐标}, ...]
		mons = [],                             % 明雷怪列表，格式：[{明雷怪编号, X坐标, Y坐标}, ...]
		spawn_mon_area_list = [],% 刷怪区域列表， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		explore_area = [],% 探索区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		dig_treasure_area = [],% 挖宝区域， 格式：[{区域编号，左下角X坐标，左下角Y坐标，宽，高}, ...]
		teleports = [] % 传送点列表，格式：[{传送编号, X坐标, Y坐标}, ...]
		};



get(_No) ->
?ASSERT(false, _No),
	null.
